#+TITLE: Plan for Lab Data Service
#+AUTHOR: VLEAD
#+DATE: [2017-10-11 Wed]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  This document contains the realization plan for
  implementing the Lab Data Service.  This application is
  realized as series of [[https://github.com/vlead/lab-data-service/milestones?state=closed][milestones]]. 

* Milestones Snapshot
  |------+---------------------+---------------------------------+------+--------+--------|
  | S.no | Requirement Mapping | Milestone                       | Plan | Status | Issues |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    1 |                     | [[https://github.com/vlead/lab-data-service/milestone/6][LDS to work with nosql]]          | [[Add information for missing labs][ref]]  | Open   | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aopen+milestone%253A%2522Migrating+LDS+service+backend+from+mysql+to+nosql+%2528monodb%2529%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    2 |                     | [[https://github.com/vlead/lab-data-service/milestone/9][Pagination]]                      |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Implementation+of+%2527Pagination%2527%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    3 |                     | [[https://github.com/vlead/lab-data-service/milestone/8][Update missing labs]]             |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Updating+LDS+with+177+Labs+data+and+adding+new+Features%252FEnhancements++%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    4 |                     | [[https://github.com/vlead/lab-data-service/milestone/7][Bug fix release]]                 |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Bug+fix+release%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    5 |                     | [[https://github.com/vlead/lab-data-service/milestone/5][New specification structure]]     |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Enhancements+in+the+LDS+according+to+the+new+lab+specification+structure+-+Release+version+V1.1.0%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    6 |                     | [[https://github.com/vlead/lab-data-service/milestone/4][Address Review Comments]]         |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Complete+funtionality+of+Lab+Data+Service+with+the+fixing+of+review+comments%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    7 |                     | [[https://github.com/vlead/lab-data-service/milestone/3][Realize for experiment entity]]   |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Next+release+of+Lab+Data+Service+with+experiments+integrated%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    8 |                     | [[https://github.com/vlead/lab-data-service/milestone/2][Capture details of missing labs]] |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Creation+of+Lab-specifications+for+all+the+labs%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  |    9 |                     | [[https://github.com/vlead/lab-data-service/milestone/1][Create the data model]]           |      | Closed | [[https://github.com/vlead/lab-data-service/issues?q=is%253Aclosed+milestone%253A%2522Lab+data+service+should+able+to+provide+the+search+by+lab+name%252C+institute+and+disciplines%2522][ref]]    |
  |------+---------------------+---------------------------------+------+--------+--------|
  #+TBLFM: $1=@#-1


* Detailed Plans
** Add information for missing labs

   This [[https://github.com/vlead/lab-data-service/milestone/8][milestone]] includes the following features:
   1. Updating LDS with 178 Labs data
   2. Features/Enhancements:
      1. Add 'Phase' table to the current Schema.
      2. Implementation of 'Migration' Script.
      3. Implementation of 'Backup' and 'Restore' Scripts. 
  
 #+caption:  realization-plan
 #+name: tbl-realization-plan
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 |    S. | Tasks                    | Github |  Expected | Actual |  Estimated |     Actual | Status | Assignee  |
 |    NO |                          | Issues |    Effort | Effort |     Start, |     Start/ |        |           |
 |       |                          |        |       (in |    (in |        End |        End |        |           |
 |       |                          |        |    person | person |      Dates |      Dates |        |           |
 |       |                          |        |    hours) | hours) |            |            |        |           |
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 |    1. | Some labs are not        | [[https://github.com/vlead/lab-data-service/issues/92][#92]]    |        60 |     48 | 09-09-2017 | 09-09-2017 | Done   | Sanchita  |
 |       | captured in lds database |        |           |        | 13-09-2017 | 13-09-2017 |        | Mrudhvika |
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 |    2. | create a new table       | [[https://github.com/vlead/lab-data-service/issues/91][#91]]    |        60 |     24 | 02-10-2017 | 03-10-2017 | Done   | Madhavi   |
 |       | 'Phase' in the database  |        |           |        | 06-10-2017 | 06-10-2017 |        |           |
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 |    3. | Implementation of        | [[https://github.com/vlead/lab-data-service/issues/95][#95]]    |         8 |      6 | 09-10-2017 | 09-10-2017 | Done   | Madhavi   |
 |       | Migration Script         |        |           |        | 09-10-2017 | 09-10-2017 |        |           |
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 |    4. | Implementation of        | [[https://github.com/vlead/lab-data-service/issues/96][#96]]    |         8 |      6 | 10-10-2017 | 10-10-2017 | Done   | Madhavi   |
 |       | 'Restore' and            |        |           |        | 10-10-2017 | 10-10-2017 |        |           |
 |       | 'Backup' Scripts         |        |           |        |            |            |        |           |
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 |    5. | Deployment of            | [[https://github.com/vlead/lab-data-service/issues/97][#97]]    |        16 |     12 | 11-10-2017 | 11-10-2017 | Done   | Madhavi   |
 |       | 'lab-data-service'       |        |           |        | 12-10-2017 | 12-10-2017 |        |           |
 |       | on Testing and           |        |           |        |            |            |        |           |
 |       | Staging Environments     |        |           |        |            |            |        |           |
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 | Total |                          |        |       153 |     96 |            |            |        |           |
 |     ^ |                          |        | estimated | actual |            |            |        |           |
 |-------+--------------------------+--------+-----------+--------+------------+------------+--------+-----------|
 #+TBLFM: $estimated=vsum(@II+1..@-1)
 #+TBLFM: $actual=vsum(@II+1..@-1)
